Infineon/REF_MTB_LV_Ceiling_Fan/CF_SL_FOC_XMC13/PMSM_FOC/Interrupts/pmsm_foc_error_handling.c
/**
 * @file pmsm_foc_error_handling.c
 * @date 09 May, 2017
 *
 * @cond
 *********************************************************************************************************************
 * PMSM FOC Motor Control Library
 *
 * Copyright (c) 2015-2017, Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * To improve the quality of the software, users are encouraged to share modifications, enhancements or bug fixes
 * with Infineon Technologies AG (dave@infineon.com).
 ***********************************************************************************************************************
 *
 * @file pmsm_foc_error_handling.c
 * @date 09 May, 2017
 * @version 1.0.1
 *
 * @brief Sensorless FOC with 3-shunt <br>
 *
 * <b>Detailed description of file</b> <br>
 *  IDE: Infineon DAVE 4, Version: 4.1.2, Installer build : 2016-09-30
 *  HW:  Infineon PMSM-LV-15W, or XMC 750 Watt Motor Control Application Kit.
 *  MCU: Infineon XMC1302.
 *
 * History
 *
 * @endcond
 *
 */

/*********************************************************************************************************************
 * HEADER FILES
 ********************************************************************************************************************/

#include <XMC1300.h>                      /* SFR declarations of the selected device */
#include "pmsm_foc_error_handling.h"

/*********************************************************************************************************************
 * GLOBAL DATA
 ********************************************************************************************************************/

extern MotorControlType Motor; /* Motor control information */
extern ADCType ADC;

#define MAX_CYCLE_TIME    1                /* Max cycle times before system reset. */

/*
 * Error handling, e.g.: to handle CCU8 TRAP protection
 * Execution time: ??us (O3 - Optimize most).
 */
void pmsm_foc_error_handling(void)
{
  static uint32_t Cycle_Counter = 0; /* Static variable and init. */

#if(MOTOR_STALL_DETECTION == ENABLED)
if ((Motor.State == TRAP_PROTECTION || Motor.error_status == PMSM_FOC_EID_STALL || Motor.State == 13))
#else
if ((Motor.State == TRAP_PROTECTION ) && (SYSTEM_BE_IDLE))
#endif
  {
    if(Motor.State == 13)
    {
      XMC_GPIO_SetOutputHigh(LED_protection);/*Protection LED testing*/
      Motor.error_status = PMSM_FOC_EID_STALL;
      Motor.Stall_detect_status = 0x01;
      Motor.fault_status = 1;

    }

    if(Motor.State == TRAP_PROTECTION)
    {
      XMC_GPIO_SetOutputHigh(LED_protection);/*OCP - testing led*/
      Motor.HW_OCP_TRAP_Status = 0x01; /*OCP - GUI indicator for HW_TRAP*/
      Motor.fault_status = 1; /*Fault status for HW_OCP detect*/
    }
    /* If CCU8 TRAP has occurred, and system becomes idle (i.e.: PWM duty cycle or POT ADC too low), */
    Cycle_Counter++;

    if (Cycle_Counter > MAX_CYCLE_TIME)
    {

		XMC_CCU8_SLICE_ClearEvent(CCU8_MODULE_PHASE_U,XMC_CCU8_SLICE_IRQ_ID_EVENT2);

        XMC_GPIO_SetMode(PHASE_U_HS_PIN, XMC_GPIO_MODE_INPUT_TRISTATE);
        XMC_GPIO_SetMode(PHASE_U_LS_PIN, XMC_GPIO_MODE_INPUT_TRISTATE);
        XMC_GPIO_SetMode(PHASE_V_HS_PIN, XMC_GPIO_MODE_INPUT_TRISTATE);
        XMC_GPIO_SetMode(PHASE_V_LS_PIN, XMC_GPIO_MODE_INPUT_TRISTATE);
        XMC_GPIO_SetMode(PHASE_W_HS_PIN, XMC_GPIO_MODE_INPUT_TRISTATE);
        XMC_GPIO_SetMode(PHASE_W_LS_PIN, XMC_GPIO_MODE_INPUT_TRISTATE);

        /*Setting to motor state stop, reset button to 'STOP', speed to zero*/
        Motor.motorstartstop = 0;
        Motor.Speed = 0;
        Motor.State = STOP_MOTOR;
    }
  }
  else
  {
    Cycle_Counter = 0; /* Clear counter. */
  }

} /* End of pmsm_foc_error_handling () */
